In [180]:
# installed xlrd
import pandas as pd

### Excel sheet 07.10 "Trip Characteristics"

In [181]:
df_10= pd.read_excel("section07.xls", sheet_name="07.10")
print(df_10)

                             Unnamed: 0    Unnamed: 1    Unnamed: 2  \
0                                   NaN           NaN           NaN
1                                   NaN           NaN           NaN
2                                   NaN           NaN           NaN
3                                   NaN           NaN           NaN
4                                   NaN           NaN           NaN
5                                   NaN           NaN           NaN
6                                   NaN           NaN           NaN
7                                   NaN           NaN           NaN
8                                   NaN           NaN           NaN
9                                   NaN  2.065689e+06  6.656779e+06
10                                  NaN           NaN           NaN
11                  Purpose of visit 1/           NaN           NaN
12                       Pleasure (net)  1.585412e+06  5.734311e+06
13                             Vacation  1.537844e+06  5.515116e+06
14                            Honeymoon  4.746113e+04  2.338577e+05
15                  Wedding/Get Married  1.430059e+04  4.534982e+04
16  Meetings, conventions, incentive 1/  9.937194e+04  9.538994e+04
17                Convention/conference  6.325789e+04  4.306084e+04
18                    Corporate meeting  2.147340e+04  2.817941e+04
19                            Incentive  1.790867e+04  2.782640e+04
20                       Other business  9.564378e+04  1.432338e+05
21           Visit friends or relatives  3.149518e+05  8.232686e+05
22               Government or military  3.497155e+04  5.663027e+04
23                        Attend school  6.972997e+03  1.499786e+04
24                          Sport event  1.364241e+04  1.833693e+04
25                                  NaN           NaN           NaN
26                      Traveler method           NaN           NaN
27                           Group tour  4.010146e+04  8.351203e+04
28                              Package  2.425189e+05  9.192191e+05
29                     True independent  1.805154e+06  5.694152e+06
30                                  NaN           NaN           NaN
31                       Accommodations           NaN           NaN
32                                Hotel  9.733389e+05  3.461805e+06
33                           Hotel only  8.181045e+05  3.010088e+06
34                                Condo  3.695491e+05  1.286219e+06
35                           Condo only  2.994723e+05  1.057556e+06
36                            Timeshare  1.882075e+05  6.757413e+05
37                       Timeshare only  1.491365e+05  5.566026e+05
38                         Rental house  2.560914e+05  7.979448e+05
39                               Hostel  1.676442e+04  3.261810e+04
40                            Camp site  1.679986e+04  3.256271e+04
41                      Bed & breakfast  2.735834e+04  6.709277e+04
42                          Cruise ship  2.192602e+04  1.723226e+03
43                   Friends, relatives  3.431115e+05  7.959866e+05

       Unnamed: 3     Unnamed: 4
0             NaN            NaN
1             NaN            NaN
2             NaN            NaN
3             NaN            NaN
4             NaN            NaN
5             NaN            NaN
6             NaN            NaN
7             NaN            NaN
8             NaN            NaN
9        612384.0  120981.000000
10            NaN            NaN
11            NaN            NaN
12  535053.683588   97479.808440
13  493663.237684   92525.661922
14    41520.12573    5031.331542
15    6238.264466     523.977561
16   33069.673806    1853.243024
17   14589.942349     559.668598
18    2922.741449     703.019068
19   16189.623401     624.318168
20    3869.829622    1856.115196
21   25984.270631   14045.000654
22    1966.249914    2980.238670
23    1781.713841     721.719024
24    3279.050518     524.447429
25            NaN            NaN
26            NaN            NaN
27           (NA)    1269.353199
28           (NA)    9615.254535
29           (NA)  110736.352381
30            NaN            NaN
31            NaN            NaN
32  441040.954235   56871.777872
33  397682.842822   50205.465155
34  106933.791697   31549.390794
35   78340.136083   27229.893869
36   29539.361331    9229.778090
37   21556.965541    7342.589221
38    33250.26952    7778.792477
39    3633.115736    1197.613877
40    3251.838926     817.025767
41    6229.677459     542.133851
42    2711.776703     106.911099
43   31259.561674   18756.936990

Drop empty cells

In [182]:
deduped_df_10 = df_10.dropna()
deduped_df_10.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
12,Pleasure (net),1.585412e+06,5.734311e+06,535053.683588,97479.808440
13,Vacation,1.537844e+06,5.515116e+06,493663.237684,92525.661922
14,Honeymoon,4.746113e+04,2.338577e+05,41520.12573,5031.331542
15,Wedding/Get Married,1.430059e+04,4.534982e+04,6238.264466,523.977561
16,"Meetings, conventions, incentive 1/",9.937194e+04,9.538994e+04,33069.673806,1853.243024

In [183]:
dropped_df_10 = deduped_df_10.drop([12,13,14,15,16,17,18,19,20,21,22,23,24,27,28,29,33,35,37,39,40,42,43])
print(dropped_df_10)

         Unnamed: 0     Unnamed: 1    Unnamed: 2     Unnamed: 3    Unnamed: 4
32            Hotel  973338.860840  3.461805e+06  441040.954235  56871.777872
34            Condo  369549.099056  1.286219e+06  106933.791697  31549.390794
36        Timeshare  188207.496859  6.757413e+05   29539.361331   9229.778090
38     Rental house  256091.399255  7.979448e+05    33250.26952   7778.792477
41  Bed & breakfast   27358.341130  6.709277e+04    6229.677459    542.133851

Rename columns

In [184]:
# renamed_df = deduped_df.rename(
#     columns = {
#     "Unnamed: 0": "Subject", 
#     "Unnamed: 1": "Domestic 2020",
#     "Unnamed: 2": "Domestic 2021", 
#     "Unnamed: 3": "International 2020", 
#     "Unnamed: 4": "International 2021"})
# renamed_df.head()

### Excel sheet 07.07 "Visitor arrivals, by area visted"

In [185]:
df_7= pd.read_excel("section07.xls", sheet_name="07.07")
print(df_7)

         Unnamed: 0      Unnamed: 1      Unnamed: 2      Unnamed: 3  \
0               NaN             NaN             NaN             NaN
1               NaN             NaN             NaN             NaN
2               NaN             NaN             NaN             NaN
3               NaN             NaN             NaN             NaN
4               NaN             NaN             NaN             NaN
5               NaN             NaN            2020             NaN
6      Area visited           Total        Domestic  Inter-national
7               NaN             NaN             NaN             NaN
8      State total   2678072.861446  2065688.861462        612384.0
9               NaN             NaN             NaN             NaN
10             Oahu  1506315.659653   998148.523944   508167.135718
11            Kauai   330262.667066   295842.755924    34419.911142
12      Maui County   807308.419573   706498.581754    100809.83782
13             Maui   792601.693654   693197.320885    99404.372769
14          Molokai    17024.986222    12998.553311     4026.432911
15            Lanai    17924.022199     15488.98345     2435.038749
16    Hawaii Island   493817.021415   402529.632083    91287.389332
17             Hilo   155032.741515   124359.793354    30672.948161
18             Kona   433193.992245   352567.633874    80626.358371
19  One island only  2311925.464449  1797842.149784   514083.314663
20        Oahu only  1212897.032808   794044.115331   418852.917476

        Unnamed: 4      Unnamed: 5      Unnamed: 6
0              NaN             NaN             NaN
1              NaN             NaN             NaN
2              NaN             NaN             NaN
3              NaN             NaN             NaN
4              NaN             NaN             NaN
5              NaN            2021             NaN
6            Total        Domestic  Inter-national
7              NaN             NaN             NaN
8   6777760.263237  6656779.263237        120981.0
9              NaN             NaN             NaN
10  3326622.092527  3250595.675265    76026.417262
11    813647.31792   807657.817604     5989.500316
12  2340914.931979  2298907.580889    42007.351091
13  2303941.517542  2262136.950777    41804.566766
14    25758.390803    25507.857103        250.5337
15     47829.24513    47290.640173      538.604956
16  1183457.998357  1172729.105042    10728.893315
17   293832.711127   291467.398143     2365.312984
18  1064571.439433   1054542.74088    10028.698553
19  5990063.982128   5880593.10609   109470.876038
20  2737924.661345  2671018.357009    66906.304337

Drop empty cells

In [186]:
deduped_df_7 = df_7.dropna()
deduped_df_7.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
6,Area visited,Total,Domestic,Inter-national,Total,Domestic,Inter-national
8,State total,2678072.861446,2065688.861462,612384.0,6777760.263237,6656779.263237,120981.0
10,Oahu,1506315.659653,998148.523944,508167.135718,3326622.092527,3250595.675265,76026.417262
11,Kauai,330262.667066,295842.755924,34419.911142,813647.31792,807657.817604,5989.500316
12,Maui County,807308.419573,706498.581754,100809.83782,2340914.931979,2298907.580889,42007.351091

Rename columns

In [187]:
# renamed_df_2 = deduped_df_2.rename(
#     columns = {
#     "Unnamed: 0": "Area Visited", 
#     "Unnamed: 1": "Total 2020",
#     "Unnamed: 2": "Domestic 2020", 
#     "Unnamed: 3": "International 2020", 
#     "Unnamed: 4": "Total 2021",
#     "Unnamed: 5": "Domestic 2021",
#     "Unnamed: 6": "International 2021"}) 
# renamed_df_2.head()

In [188]:
dropped_df_7 = deduped_df_7.drop([6,8,12,17,18,19,20])
print(dropped_df_7)

       Unnamed: 0      Unnamed: 1     Unnamed: 2     Unnamed: 3  \
10           Oahu  1506315.659653  998148.523944  508167.135718
11          Kauai   330262.667066  295842.755924   34419.911142
13           Maui   792601.693654  693197.320885   99404.372769
14        Molokai    17024.986222   12998.553311    4026.432911
15          Lanai    17924.022199    15488.98345    2435.038749
16  Hawaii Island   493817.021415  402529.632083   91287.389332

        Unnamed: 4      Unnamed: 5    Unnamed: 6
10  3326622.092527  3250595.675265  76026.417262
11    813647.31792   807657.817604   5989.500316
13  2303941.517542  2262136.950777  41804.566766
14    25758.390803    25507.857103      250.5337
15     47829.24513    47290.640173    538.604956
16  1183457.998357  1172729.105042  10728.893315

### 2018/2019 Visitor Arrivals

In [189]:
df_7_2019= pd.read_excel("section07.2019.xlsx", sheet_name="07.07")
print(df_7_2019)

   Table 7.07-- VISITOR ARRIVALS, BY AREA VISITED:  2018 AND 2019  \
0                                                 NaN
1   [Covers visitors who arrived by air and stayed...
2     includes passengers from all flights origina...
3     includes passengers from all flights origina...
4                                                 NaN
5                                                 NaN
6                                        Area visited
7                                                 NaN
8                                        State total
9                                                 NaN
10                                               Oahu
11                                              Kauai
12                                        Maui County
13                                               Maui
14                                            Molokai
15                                              Lanai
16                                      Hawaii Island
17                                               Hilo
18                                               Kona
19                                    One island only
20                                          Oahu only
21                                                NaN
22                                                NaN
23       Source:  Hawaii Tourism Authority, Touris...
24  <https://www.hawaiitourismauthority.org/resear...
25                                       and records.

        Unnamed: 1      Unnamed: 2       Unnamed: 3       Unnamed: 4  \
0              NaN             NaN              NaN              NaN
1              NaN             NaN              NaN              NaN
2              NaN             NaN              NaN              NaN
3              NaN             NaN              NaN              NaN
4              NaN             NaN              NaN              NaN
5              NaN            2018              NaN              NaN
6           Total         Domestic  Inter-national             Total
7              NaN             NaN              NaN              NaN
8   9761448.055986  6736736.055989        3024712.0  10243165.024103
9              NaN             NaN              NaN              NaN
10  5862357.577556  3217740.281575    2644617.29598   6154248.093969
11  1389300.423018  1209338.377554    179962.045464   1370028.606504
12  2963564.075699  2473376.846713    490187.228987   3111131.460024
13  2914912.070158  2432853.608285    482058.461874   3059904.749288
14    58885.489912    42440.653487     16444.836425     63034.667872
15    75010.305614    54310.073018     20700.232597      84102.95976
16  1706217.780855  1291109.460392    415108.320463   1763904.023422
17   601159.812714   424719.609204     176440.20351    600490.325644
18  1488699.525585  1134812.912673    353886.612912   1553720.971394
19  8099892.222275  5627323.262461   2472568.959815   8595523.516356
20  4499507.321051  2372338.168146   2127169.152905   4799335.809374
21             NaN             NaN              NaN              NaN
22             NaN             NaN              NaN              NaN
23             NaN             NaN              NaN              NaN
24             NaN             NaN              NaN              NaN
25             NaN             NaN              NaN              NaN

        Unnamed: 5      Unnamed: 6
0              NaN             NaN
1              NaN             NaN
2              NaN             NaN
3              NaN             NaN
4              NaN             NaN
5             2019             NaN
6         Domestic  Inter-national
7              NaN             NaN
8   7253806.024038       2989359.0
9              NaN             NaN
10  3513070.170926  2641177.922997
11  1211259.804112   158768.802392
12   2650786.88681   460344.573213
13  2609797.643723   450107.105566
14    44304.320365    18730.347507
15    58799.108837    25303.850924
16  1361151.131748   402752.891676
17   438107.297595   162383.028049
18  1205698.079465   348022.891932
19  6114793.810327   2480729.70603
20  2638592.862547  2160742.946826
21             NaN             NaN
22             NaN             NaN
23             NaN             NaN
24             NaN             NaN
25             NaN             NaN

Drop nulls

In [190]:
deduped_df_7_2019 = df_7_2019.dropna()
deduped_df_7_2019.head()

,"Table 7.07-- VISITOR ARRIVALS, BY AREA VISITED: 2018 AND 2019",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
6,Area visited,Total,Domestic,Inter-national,Total,Domestic,Inter-national
8,State total,9761448.055986,6736736.055989,3024712.0,10243165.024103,7253806.024038,2989359.0
10,Oahu,5862357.577556,3217740.281575,2644617.29598,6154248.093969,3513070.170926,2641177.922997
11,Kauai,1389300.423018,1209338.377554,179962.045464,1370028.606504,1211259.804112,158768.802392
12,Maui County,2963564.075699,2473376.846713,490187.228987,3111131.460024,2650786.88681,460344.573213

Drop empties

In [191]:
dropped_df_7_2019 = deduped_df_7_2019.drop([6,8,12,17,18,19,20])
print(dropped_df_7_2019)

   Table 7.07-- VISITOR ARRIVALS, BY AREA VISITED:  2018 AND 2019  \
10                                               Oahu
11                                              Kauai
13                                               Maui
14                                            Molokai
15                                              Lanai
16                                      Hawaii Island

        Unnamed: 1      Unnamed: 2     Unnamed: 3      Unnamed: 4  \
10  5862357.577556  3217740.281575  2644617.29598  6154248.093969
11  1389300.423018  1209338.377554  179962.045464  1370028.606504
13  2914912.070158  2432853.608285  482058.461874  3059904.749288
14    58885.489912    42440.653487   16444.836425    63034.667872
15    75010.305614    54310.073018   20700.232597     84102.95976
16  1706217.780855  1291109.460392  415108.320463  1763904.023422

        Unnamed: 5      Unnamed: 6
10  3513070.170926  2641177.922997
11  1211259.804112   158768.802392
13  2609797.643723   450107.105566
14    44304.320365    18730.347507
15    58799.108837    25303.850924
16  1361151.131748   402752.891676

### Excel sheet 7.16 "Island experience"

In [192]:
df_16= pd.read_excel("section07.xls", sheet_name="07.16")
print(df_16)

   Table 7.16-- OVERALL ISLAND EXPERIENCE BY VISITORS FROM THE  Unnamed: 1
0     U.S. TOTAL, U.S. WEST, U.S. EAST, AND JAPAN:...                  NaN
1                                                 NaN                  NaN
2                                                 NaN                  NaN
3                                                 NaN                  NaN
4                                                 NaN                  NaN
5                                   Island and rating           U.S. total
6                                                 NaN                  NaN
7                                                Oahu                  NaN
8                                           Excellent             74.56781
9                                       Above average            17.021864
10                                      Below average               5.4093
11                                               Poor             3.001026
12                                                NaN                  NaN
13                                               Maui                  NaN
14                                          Excellent            86.081271
15                                      Above average             9.136139
16                                      Below average             3.039964
17                                               Poor             1.742626
18                                                NaN                  NaN
19                                            Molokai                  NaN
20                                          Excellent            84.472353
21                                      Above average            10.185999
22                                      Below average             5.341648
23                                               Poor                    0
24                                                NaN                  NaN
25                                              Lanai                  NaN
26                                          Excellent            86.019802
27                                      Above average              8.49379
28                                      Below average             3.349234
29                                               Poor             2.137174
30                                                NaN                  NaN
31                      Hawai‘i (Hilo/ Kona/ Volcano)                  NaN
32                                          Excellent            85.196997
33                                      Above average            10.677396
34                                      Below average             3.289596
35                                               Poor             0.836011
36                                                NaN                  NaN
37                                              Kauai                  NaN
38                                          Excellent            83.793073
39                                      Above average            10.263686
40                                      Below average             4.155042
41                                               Poor             1.788199

Drop empty cells

In [193]:
dropped_df_16 = df_16.drop([0,1,2,3,4,6,8,12,14,18,23,24,30,36])
print(dropped_df_16)

   Table 7.16-- OVERALL ISLAND EXPERIENCE BY VISITORS FROM THE  Unnamed: 1
5                                   Island and rating           U.S. total
7                                                Oahu                  NaN
9                                       Above average            17.021864
10                                      Below average               5.4093
11                                               Poor             3.001026
13                                               Maui                  NaN
15                                      Above average             9.136139
16                                      Below average             3.039964
17                                               Poor             1.742626
19                                            Molokai                  NaN
20                                          Excellent            84.472353
21                                      Above average            10.185999
22                                      Below average             5.341648
25                                              Lanai                  NaN
26                                          Excellent            86.019802
27                                      Above average              8.49379
28                                      Below average             3.349234
29                                               Poor             2.137174
31                      Hawai‘i (Hilo/ Kona/ Volcano)                  NaN
32                                          Excellent            85.196997
33                                      Above average            10.677396
34                                      Below average             3.289596
35                                               Poor             0.836011
37                                              Kauai                  NaN
38                                          Excellent            83.793073
39                                      Above average            10.263686
40                                      Below average             4.155042
41                                               Poor             1.788199

Fill null cells that need to be kept

In [194]:
filled_df_16 = dropped_df_16.fillna('')
filled_df_16.head()

   Table 7.16-- OVERALL ISLAND EXPERIENCE BY VISITORS FROM THE  Unnamed: 1
5                                   Island and rating           U.S. total
7                                                Oahu
9                                       Above average            17.021864
10                                      Below average               5.4093
11                                               Poor             3.001026

### Excel sheet 34 "Average room prices"

In [195]:
df_34= pd.read_excel("section07.xls", sheet_name="07.34", usecols='A:B')
df_34.head()

,"Table 7.34-- VISITOR INDUSTRY PRICES, PRICE INDEXES, AND PRICE",Unnamed: 1
0,DEFLATOR: 1991 TO 2021,NaN
1,NaN,NaN
2,NaN,NaN
3,Year,Average daily room rate 1/ (dollars)
4,NaN,NaN

Drop empty cells

In [196]:
deduped_df_34 = df_34.dropna()
deduped_df_34.head()

,"Table 7.34-- VISITOR INDUSTRY PRICES, PRICE INDEXES, AND PRICE",Unnamed: 1
3,Year,Average daily room rate 1/ (dollars)
5,1991,101.89
6,1992,105.59
7,1993,103.26
8,1994,105.46

2019 Trip characteristics

In [197]:
df_10_2019= pd.read_excel("section07.2019.xlsx", sheet_name="07.10")
print(df_10_2019)

   Table 7.10-- TRIP CHARACTERISTICS OF VISITORS: 2018 AND 2019  \
0                                                 NaN
1   [Covers visitors who arrived by air and stayed...
2     includes passengers from all flights origina...
3     includes passengers from all flights origina...
4                                                 NaN
5                                                 NaN
6                                             Subject
7                                                 NaN
8                                     All visitors 1/
9                                                 NaN
10                                Purpose of visit 1/
11                                     Pleasure (net)
12                                           Vacation
13                                          Honeymoon
14                                Wedding/Get Married
15                Meetings, conventions, incentive 1/
16                              Convention/conference
17                                  Corporate meeting
18                                          Incentive
19                                     Other business
20                         Visit friends or relatives
21                             Government or military
22                                      Attend school
23                                        Sport event
24                                                NaN
25                                    Traveler method
26                                         Group tour
27                                            Package
28                                   True independent
29                                                NaN
30                                     Accommodations
31                                              Hotel
32                                         Hotel only
33                                              Condo
34                                         Condo only
35                                          Timeshare
36                                     Timeshare only
37                                       Rental house
38                                             Hostel
39                                          Camp site
40                                    Bed & breakfast
41                                        Cruise ship
42                                 Friends, relatives
43                                                NaN
44                                                NaN
45  1/  Because of multiple responses, detail may ...
46       Source:  Hawaii Tourism Authority, Touris...
47  <https://www.hawaiitourismauthority.org/resear...
48                                       and records.

        Unnamed: 1    Unnamed: 2      Unnamed: 3    Unnamed: 4
0              NaN           NaN             NaN           NaN
1              NaN           NaN             NaN           NaN
2              NaN           NaN             NaN           NaN
3              NaN           NaN             NaN           NaN
4              NaN           NaN             NaN           NaN
5         Domestic           NaN   International           NaN
6             2018  2.019000e+03            2018  2.019000e+03
7              NaN           NaN             NaN           NaN
8   6736736.055989  7.253806e+06       3024712.0  2.989359e+06
9              NaN           NaN             NaN           NaN
10             NaN           NaN             NaN           NaN
11  5594930.890898  6.057786e+06    2633642.9517  2.619941e+06
12  5369681.299388  5.833536e+06  2330693.528063  2.327895e+06
13   228615.301854  2.260048e+05   300775.463051  2.901876e+05
14    56653.590214  5.527781e+04    45859.204847  4.381943e+04
15   313516.551054  3.131850e+05    157856.71645  1.459857e+05
16   197447.773446  1.833994e+05    53147.084771  4.731704e+04
17      70672.7558  7.634092e+04      9904.33716  1.523434e+04
18    56307.705396  6.415818e+04    98035.433189  8.520230e+04
19   240717.942301  2.528426e+05    17284.816742  1.834243e+04
20   709184.067266  7.513774e+05    84621.918074  8.453023e+04
21    91142.961729  8.701993e+04    13101.928439  1.670822e+04
22    14142.725609  1.494816e+04    11700.235919  1.056804e+04
23    65796.348921  6.876657e+04    26169.442782  2.909063e+04
24             NaN           NaN             NaN           NaN
25             NaN           NaN             NaN           NaN
26   164704.126959  1.636167e+05   342425.024516  3.214359e+05
27   1206398.06852  1.249443e+06   1318659.50227  1.341724e+06
28  5465283.707661  5.938291e+06  1629209.560199  1.571521e+06
29             NaN           NaN             NaN           NaN
30             NaN           NaN             NaN           NaN
31  3581232.304172  3.863229e+06   2282953.81996  2.250648e+06
32  2990087.233111  3.263870e+06  2064530.724652  2.051159e+06
33  1190791.492733  1.245480e+06   480816.011134  4.542847e+05
34   938986.492104  9.980504e+05   348485.492694  3.378014e+05
35   681247.976325  6.946531e+05   161084.190767  1.587284e+05
36   530577.641803  5.487710e+05   120354.672696  1.200913e+05
37    805128.55348  8.890611e+05   147929.794685  1.477591e+05
38    53491.153891  5.581139e+04      28009.5403  2.967859e+04
39    46250.911142  5.024300e+04    12502.669189  1.360033e+04
40    87610.869913  9.458986e+04    29547.190859  2.426145e+04
41   108900.234612  1.180525e+05    25793.772079  2.523569e+04
42   790992.720227  8.374156e+05    86634.382741  9.923894e+04
43             NaN           NaN             NaN           NaN
44             NaN           NaN             NaN           NaN
45             NaN           NaN             NaN           NaN
46             NaN           NaN             NaN           NaN
47             NaN           NaN             NaN           NaN
48             NaN           NaN             NaN           NaN

In [198]:
deduped_df_10_2019 = df_10_2019.dropna()
deduped_df_10_2019.head()

,Table 7.10-- TRIP CHARACTERISTICS OF VISITORS: 2018 AND 2019,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
6,Subject,2018,2.019000e+03,2018,2.019000e+03
8,All visitors 1/,6736736.055989,7.253806e+06,3024712.0,2.989359e+06
11,Pleasure (net),5594930.890898,6.057786e+06,2633642.9517,2.619941e+06
12,Vacation,5369681.299388,5.833536e+06,2330693.528063,2.327895e+06
13,Honeymoon,228615.301854,2.260048e+05,300775.463051,2.901876e+05

In [199]:
dropped_df_10_2019 = deduped_df_10_2019.drop([6,8,11,12,13,14,15,16,17,18,19,20,21,22,23,26,27,28,32,34,36,38,39,41,42])
print(dropped_df_10_2019)

   Table 7.10-- TRIP CHARACTERISTICS OF VISITORS: 2018 AND 2019  \
31                                              Hotel
33                                              Condo
35                                          Timeshare
37                                       Rental house
40                                    Bed & breakfast

        Unnamed: 1    Unnamed: 2     Unnamed: 3    Unnamed: 4
31  3581232.304172  3.863229e+06  2282953.81996  2.250648e+06
33  1190791.492733  1.245480e+06  480816.011134  4.542847e+05
35   681247.976325  6.946531e+05  161084.190767  1.587284e+05
37    805128.55348  8.890611e+05  147929.794685  1.477591e+05
40    87610.869913  9.458986e+04   29547.190859  2.426145e+04

indexing attempt
set_index([pd.Index([1, 2, 3, 4])])
df.index = ['row{0}'.format(n) for n in range(df.index.shape[0])]

convert to CSV

In [200]:
dropped_df_10.to_csv('stats.csv', header=None, encoding = "utf-8")
dropped_df_10_2019.to_csv('stats_10_2019.csv', header = None, encoding = "utf-8")
dropped_df_7.to_csv('stats_table7.csv', header=None, encoding = "utf-8")
dropped_df_7_2019.to_csv('stats_table7_2019.csv', header=None, encoding = "utf-8")
filled_df_16.to_csv('stats_table16.csv', header=None, encoding = "utf-8")
deduped_df_34.to_csv('stats_table34.csv',header=None, encoding = "utf-8")